[
    {
      "area": "Shelter",
      "subcategories": [
        {
          "title": "Low-cost, Durable Construction Methods",
          "description": "Learn how to build safe, long-lasting structures using simple tools and affordable materials. Ideal for creating strong shelters in resource-limited areas.",
          "tags": ["construction", "low-cost", "durable", "building"]
        },
        {
          "title": "Locally Available Materials",
          "description": "Find out how to identify and use materials from your immediate surroundings—like earth, bamboo, or recycled materials—to lower costs and support sustainability.",
          "tags": ["materials", "local", "sustainability"]
        }
      ]
    },
    {
      "area": "Water",
      "subcategories": [
        {
          "title": "Purification",
          "description": "Use household items or low-cost filters to make water safe for drinking. Includes simple boiling, sand filtering, and solar disinfection techniques.",
          "tags": ["clean water", "filtration", "health"]
        },
        {
          "title": "Desalination",
          "description": "Build small-scale systems to turn salty or brackish water into fresh water using heat and condensation. Great for coastal or saline-prone areas.",
          "tags": ["salt removal", "ocean", "irrigation"]
        },
        {
          "title": "Efficient Distribution",
          "description": "Design and improve gravity-fed or pump-based systems to distribute water evenly and reduce waste. Tips include pipe layout, storage tanks, and elevation tricks.",
          "tags": ["pipes", "delivery", "infrastructure"]
        }
      ]
    },
    {
      "area": "Energy",
      "subcategories": [
        {
          "title": "DIY Solar Energy",
          "description": "Set up your own solar panel systems for basic lighting and device charging. Covers solar panel positioning, batteries, and wiring safety.",
          "tags": ["solar", "DIY", "power", "off-grid"]
        },
        {
          "title": "Biogas Generation",
          "description": "Turn kitchen and animal waste into clean-burning gas for cooking. Learn how to build a small digester, maintain it, and safely use the gas.",
          "tags": ["biogas", "waste", "energy", "renewable"]
        },
        {
          "title": "Microgrids for Sustainable Power",
          "description": "Build small, local power systems that connect solar, wind, or battery energy to homes and clinics. Learn how to balance loads and increase energy access.",
          "tags": ["microgrid", "sustainability", "infrastructure"]
        }
      ]
    },
    {
      "area": "Health",
      "subcategories": [
        {
          "title": "EMT Skills",
          "description": "Learn lifesaving basics such as CPR, wound dressing, splinting, and how to assess an emergency before help arrives.",
          "tags": ["EMT", "emergency", "first response"]
        },
        {
          "title": "Telemedicine",
          "description": "Use phones and simple apps to connect with doctors remotely. Learn how to explain symptoms, send photos, and follow up with online care.",
          "tags": ["health", "telemedicine", "remote care"]
        },
        {
          "title": "First Aid",
          "description": "Master everyday skills for cuts, burns, insect bites, and fevers. Helps reduce complications when access to a clinic is delayed.",
          "tags": ["first aid", "injury", "emergency"]
        },
        {
          "title": "Self-sufficient Healthcare",
          "description": "Set up a basic first aid station at home or in your village. Includes herbal remedies, rehydration recipes, and supply checklists.",
          "tags": ["health", "DIY", "self-reliance"]
        }
      ]
    },
    {
      "area": "Sustainable Food",
      "subcategories": [
        {
          "title": "Urban Gardening",
          "description": "Grow healthy vegetables in small spaces using buckets, rooftops, or window boxes. Learn how to compost and plant in cycles.",
          "tags": ["urban farming", "gardening", "food security"]
        },
        {
          "title": "Hydroponics",
          "description": "Use water-based growing systems to raise food without soil. Learn to mix nutrient solutions and maintain pH for healthy crops.",
          "tags": ["hydroponics", "water-efficient", "urban food"]
        },
        {
          "title": "Sustainable Agriculture Techniques",
          "description": "Practice crop rotation, natural pest control, and cover cropping to improve soil health and increase yields without chemicals.",
          "tags": ["agriculture", "sustainable", "soil health"]
        }
      ]
    }
  ]
  